/*
===========================================================================
                              Толь бичиг апп 

 Hi, Bill Bilguun байна 

 Энэ хүү файлийг илгээхээс өмнө та код яаж ажилж байгааг сайтар ажилган
 чадхаараа ойлгохыг хийчээгээрэй. Чадвал өөрийнхөөрөө бичиж үзээрэй :)

 файл илгээхээс өмнөх анхаарах зүйлс:
 1. Хувьсагчуудын нэрийг өөрийнхөөрөө өөрчлөх жишээ нь (shouldClose => shC)
 2. Массив (array) дайхь тэмдэгт мөрүүдийг(string) өөрчлөх (үгсийг өөрчлөх)
 3. Бүх коммэнт хэсэгийг устгах
 
  
  зарим compiler UNICODE танихгүй учир монгол үгсийг англи 
  цагаан толгой ашигласан
  бичсэн болно
 
                            танд амжилт хүсье :)

 ===========================================================================
*/

#include <stdio.h>
#include <string.h>

int main ()
{
  /*
    1. Толь бичгээ тус тус 10x20 хэмжээтэй массивд оруулах en[үгсийн_тоо][үгсийн_дээд_урт]
  */
  char en[10][20] = { {"dog"}, {"cat"}, {"bird"},{"tiger"},{"dragon"},{"sheep"},{"mouse"},{"deer"},{"moose"},{"bear"}};
  char mn[10][20] = { {"nohoi"}, {"muur"}, {"shuvuu"},{"bar"},{"luu"},{"honi"},{"hulgana"},{"buga"},{"handgai"},{"baavgai"} };
  
  //2. гараас авах тэмдэгт мөр буюу хайх үг
  char str[20];
  
  //3. программ хэзээ хээгдахыг шийднэ
  int shouldClose= 0;
  
  printf("Toli bichig\n");
  
  //4. программ shouldClose = 0 бол уншисаар байна 
  while(shouldClose==0){
    printf("%s","Haih ug: ");
    //5. Хайх үгээ гараас авч байна
    scanf("%s",str);
    
    //6. Гараас оруулсан үг монгол эсэхийг шийднэ
    int isSameInMn; 
    //7. Гараас оруулсан үг англи эсэхийг шийднэ
    int isSameInEn;
  
    //8. for loop ашиглан (0-10) хүртлэх тоог гүүлгэж байна
    for (int i = 0; i < 10; i++){

        /*
         9. гараас авсан үгийг en[i] mn[i] тус тус массивтай 
            тулгаж <string.h> сангаас strcmp функцийг дуудаж тулгаж байна.
            Адил бол (isSameInEn , isSameInMn) хувисагчдын зөвхөн 1 нь л (0) тэй
            тэнцүү болно. Учир нь бид гараас 1 үг авж байгаа ба тэр үг нь
            нэг бол монгол эсвэл англи үг байх нь зайлгүй юм.
        */
        isSameInEn = strcmp(str,en[i]);
        isSameInMn = strcmp(str,mn[i]);
        
        /*
        10. if statement ашиглан (isSameInEn , isSameInMn) хувьсагчдыг тус тус
            тэгтэй тэнцүү эсэхийг шалгаж байна. Хэрэв нөхцөл хангагдвал бид
            2 дахьч массив дахь үгийг хэвлэж аруулан shouldClose = 1 утга өгөн
            программыг зогсоох болно.
        */
        if(isSameInMn==0){
            //
            printf("\nmongol/angli\n%s -> %s\n",str,en[i]);
            shouldClose=1;
        }
        if(isSameInEn==0){
            printf("\nangli/mongol:\n%s -> %s\n",str,mn[i]);
            shouldClose=1;
        };
        
    }
    /*
     Хэрэв гараас оруулсан үг 2 массиваас олдоогүй бол үг олдсонгүй гэж 
     хэвлэх ба программ маань дахин уншиж эхлэнэ.
    */
    if(isSameInMn!=0 && isSameInEn!=0 && shouldClose ==0)printf("%8s","Ug oldsongui :(\n");
  }
  
  return 0;
}
